#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mkaesz-dev/tf-tfc-github-demo/runs/run-UtMn4M2FtHKLRrvt

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
data.google_compute_network.default: Reading...
google_storage_bucket.bucket: Refreshing state... [id=static-content-bucket-msk-0815]
google_storage_bucket_access_control.public_rule: Refreshing state... [id=static-content-bucket-msk-0815/allUsers]
data.google_compute_network.default: Read complete after 1s [id=projects/msk-pub/global/networks/default]
google_compute_firewall.default: Refreshing state... [id=projects/msk-pub/global/firewalls/firewall]
google_compute_instance.vm: Refreshing state... [id=projects/msk-pub/zones/europe-west3-a/instances/vm0815]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.vm must be replaced
-/+ resource "google_compute_instance" "vm" {
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/msk-pub/zones/europe-west3-a/instances/vm0815" -> (known after apply)
      ~ instance_id             = "1142422352833890425" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "xa0HlDIq_74=" -> (known after apply)
      + min_cpu_platform        = (known after apply)
        name                    = "vm0815"
      ~ project                 = "msk-pub" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/msk-pub/zones/europe-west3-a/instances/vm0815" -> (known after apply)
        tags                    = [
            "web",
        ]
      ~ tags_fingerprint        = "3d9fNIIa_10=" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/msk-pub/zones/europe-west3-a/disks/vm0815" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2110-impish-v20220505" -> "ubuntu-2110-impish-v20220505"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> 12 # forces replacement
                # (1 unchanged attribute hidden)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/msk-pub/global/networks/default" -> "default"
          ~ network_ip         = "10.156.0.14" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/msk-pub/regions/europe-west3/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "msk-pub" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.159.42.5" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "949939019889-compute@developer.gserviceaccount.com" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ web = "34.159.42.5:9090" -> (known after apply)

```

</details>

*Pushed by: @mkaesz, Action: `pull_request`*